aws/amazon-freertos/vendors/cypress/MTB/psoc6/mw/capsense/cy_capsense_csx.c
/*******************************************************************************
* Function Name: Cy_CapSense_CSXScan
****************************************************************************//**
*
* This function initiates a scan for the sensors of the widget initialized 
* by the Cy_CapSense_CSXSetupWidget() function.
*
* \note This function is obsolete and kept for backward compatibility only. 
* The Cy_CapSense_Scan() function should be used instead.
*
* This function does the following tasks:
* 1. Connects the first sensor of the widget.
* 2. Configures the IDAC value.
* 3. Starts scanning for the first sensor in the widget.
*
* This function is called by the Cy_CapSense_Scan() if the given
* widget uses the CSX sensing method.
*
* Calling this function directly from the application program is not
* recommended. This function is used to implement only the user's specific
* use cases (for example faster execution).
*
* This function is called when no scanning is in progress. I.e.
* Cy_CapSense_IsBusy() returns a non-busy status and the widget must be
* preconfigured using the Cy_CapSense_CSXSetupWidget() function prior
* to calling this function.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXScan(cy_stc_capsense_context_t * context)
{
    Cy_CapSense_InitActivePtrSns(0u, context);
    
    /* Connect electrodes */
    Cy_CapSense_CSXConnectTxExt(context);
    Cy_CapSense_CSXConnectRxExt(context);

    /* Set Start of scan flag */
    Cy_CapSense_SetBusyFlags(context);
    /* Set scope flag */
    context->ptrActiveScanSns->scanScopeSns = CY_CAPSENSE_SCAN_SCOPE_ALL_SNS;

    Cy_CapSense_CSXStartSample(context);
}

/*******************************************************************************
* Function Name: Cy_CapSense_CSXScanExt()
****************************************************************************//**
*
* Starts the CSD conversion on the preconfigured sensor. 
* 
* \note This function is obsolete and kept for backward compatibility only. 
* The Cy_CapSense_ScanExt() function should be used instead.
*
* This function performs scanning of a specific sensor in the widget 
* previously initialized using the Cy_CapSense_CSXSetupWidgetExt() function. 
* 
* This function is called when no scanning is in progress. 
* I.e. Cy_CapSense_IsBusy() returns a non-busy status and the widget must 
* be preconfigured using Cy_CapSense_CSXSetupWidgetExt() function prior 
* to calling this function. Calling this function directly from 
* the application program is not recommended. This function is used to 
* implement only the user's specific use cases (for example faster execution).
* 
* This function does not disconnect sensor GPIOs from CSD HW block at the 
* end of a scan, therefore making subsequent scan of the same sensor is faster. 
* If sensor must be disconnected after the scan, 
* the Cy_CapSense_CSXDisconnectTx() or Cy_CapSense_CSXDisconnectRx() functions
* can be used.
* 
* Calling Cy_CapSense_SetupWidget(), Cy_CapSense_CSXSetupWidget(), 
* Cy_CapSense_ScanAllWidgets(), or if Cy_CapSense_RunTuner() returns 
* CY_CAPSENSE_STATUS_RESTART_DONE status invalidated initialization 
* made by this function.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXScanExt(cy_stc_capsense_context_t * context)
{
    cy_stc_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;

    /* Set MFS channel index to 0 */
    ptrActive->mfsChannelIndex = 0u;

    /* Initialize the Active Context pointer with the CH0 context */
    ptrActive->ptrSnsContext = &ptrActive->ptrWdConfig->ptrSnsContext[ptrActive->sensorIndex];
    
    /* Set busy flag and start conversion */
    Cy_CapSense_SetBusyFlags(context);
    /* Set scope flag */
    context->ptrActiveScanSns->scanScopeSns = CY_CAPSENSE_SCAN_SCOPE_SGL_SNS;

    Cy_CapSense_CSXStartSample(context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSXCalibrateWidget
****************************************************************************//**
*
* Executes the IDAC calibration for all the sensors in the widget specified in
* the input.
*
* \note This function is obsolete and kept for backward compatibility only. 
* The Cy_CapSense_CalibrateWidget() function should be used instead.
*
* Performs a successive approximation search algorithm to find appropriate
* IDAC values for all sensors in the specified widget that provide 
* the raw count to the level specified by the target parameter.
*
* Calibration returns CYRET_BAD_DATA if the achieved raw count is outside 
* of the range specified by the target and acceptable calibration deviation
* parameters.
*
* This function could be used when the CSX Enable IDAC auto-calibration
* parameter is enabled. 
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found 
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param target
* Specifies the calibration target in percentages of the maximum raw count.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified widget calibration:
* - CYRET_SUCCESS       - The operation is successfully completed.
* - CYRET_BAD_PARAM     - The input parameter is invalid.
* - CYRET_BAD_DATA      - The calibration failed and CapSense may not operate
*                         as expected.
* - CYRET_INVALID_STATE - The previous scanning is not completed, and 
*                         the CapSense middleware is busy.
*
*******************************************************************************/
cy_status Cy_CapSense_CSXCalibrateWidget(
                uint32_t widgetId, 
                uint32_t target, 
                cy_stc_capsense_context_t * context)
{
    uint32_t cpuFreqMHz;
    uint32_t watchdogCounter;

