aws/amazon-freertos/vendors/cypress/MTB/psoc6/mw/capsense/cy_capsense_csx.c
/*******************************************************************************
* Function Name: Cy_CapSense_SsCSXStartSample
****************************************************************************//**
*
* Starts scanning for the CSX widget.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSXStartSample(cy_stc_capsense_context_t * context)
{
    /* Set up IDAC Value */
    Cy_CapSense_CSXSetUpIdacs(context);
        
    /* Clear previous interrupts */
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_INTR, CY_CAPSENSE_CSD_INTR_ALL_MSK);
    (void)Cy_CSD_ReadReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_INTR);

    /* Enable interrupt */
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_INTR_MASK, CY_CAPSENSE_CSD_INTR_MASK_SAMPLE_MSK);
    
    if(NULL != context->ptrCommonContext->ptrSSCallback)
    {
        context->ptrCommonContext->ptrSSCallback(context->ptrActiveScanSns);
    }

    Cy_CapSense_CSXStartSampleExt(context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSXConnectRx
****************************************************************************//**
*
* Connects port pin (an Rx electrode) to the CSD HW block using AMUX bus.
* 
* This function can be used to customize the default sensor connection 
* by connecting one or more pins to an existing sensor as an Rx electrode
* prior to initiating scan of the sensor.
* 
* The function ignores whether the sensor is a ganged sensor and 
* connects only a specified port pin to the CSD HW block. This function can 
* only use GPIOs that is already assigned to CapSense middleware.
* 
* The functions that perform a setup and scan of a sensor/widget do not 
* take into account changes in the design made by 
* the Cy_CapSense_CSXConnectRx() function. Hence all GPIOs connected 
* using this function must be disconnected using 
* the Cy_CapSense_CSXDisconnectRx() function prior to initializing 
* new widgets. Use this function in StartSample 
* callback (see the \ref group_capsense_callbacks section for details) 
* or with low-level functions that perform a single-sensor scanning.
* 
* Scanning should be completed before calling this function.
*
* \param rxPtr
* Specifies the pointer to the cy_stc_capsense_pin_config_t object belonging to
* a sensor which to be connected to the CSD HW block as an Rx electrode.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \funcusage
* 
* An example of using the function to perform port pin re-connection: 
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_CSXConnect
* 
*******************************************************************************/
void Cy_CapSense_CSXConnectRx(
                const cy_stc_capsense_pin_config_t * rxPtr, 
                cy_stc_capsense_context_t * context)
{
    Cy_CapSense_SsConfigPinRegisters(rxPtr->pcPtr, (uint32_t)rxPtr->pinNumber, CY_GPIO_DM_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSXConnectTx
****************************************************************************//**
*
* Connects port pin (a Tx electrode) to the CSD HW block.
* 
* This function can be used to customize the default sensor connection 
* by connecting one or more pins to an existing sensor as a Tx electrode
* prior to initiating scan of the sensor.
* 
* The function ignores whether the sensor is a ganged sensor and 
* connects only a specified port pin to the CSD HW block. This function can 
* only use GPIOs that is already assigned to CapSense middleware.
* 
* The functions that perform a setup and scan of a sensor/widget do not 
* take into account changes in the design made by 
* the Cy_CapSense_CSXConnectTx() function. Hence all GPIOs connected 
* using this function must be disconnected using 
* the Cy_CapSense_CSXDisconnectTx() function prior to initializing 
* new widgets. Use this function in StartSample 
* callback (see the \ref group_capsense_callbacks section for details) 
* or with low-level functions that perform a single-sensor scanning.
* 
* Scanning should be completed before calling this function.
*
* \param txPtr
* Specifies the pointer to the cy_stc_capsense_pin_config_t object belonging to
* a sensor which to be connected to the CSD HW block as a Tx electrode.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \funcusage
* 
* An example of using the function to perform port pin re-connection: 
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_CSXConnect
* 
*******************************************************************************/
void Cy_CapSense_CSXConnectTx(
                const cy_stc_capsense_pin_config_t * txPtr, 
                cy_stc_capsense_context_t * context)
{
    Cy_CapSense_SsConfigPinRegisters(txPtr->pcPtr, (uint32_t)txPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSXDisconnectRx
****************************************************************************//**
* 
* Disconnects port pin (an Rx electrode) from the CSD HW block by disconnecting 
* it from the AMUX bus.
* 
* This function can be used to disconnect a sensor connected 
* using the Cy_CapSense_CSXConnectRx() function. In addition, this 
* function can be used to customize default sensor connection by 
* disconnecting one or more already connected sensors prior to 
* initiating scan of the sensor.
* 
* This function works identically to the Cy_CapSense_CSDConnectRx() function 
* except it disconnects the specified port pin used by the sensor.
*
* Scanning should be completed before calling this function.
*
* \param rxPtr
* Specifies the pointer to the cy_stc_capsense_pin_config_t object belonging
* to an Rx pin sensor to be disconnected from the CSD HW block.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \funcusage
* 
* An example of using the function to perform port pin re-connection: 
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_CSXConnect
* 
*******************************************************************************/
void Cy_CapSense_CSXDisconnectRx(
                const cy_stc_capsense_pin_config_t * rxPtr, 
                cy_stc_capsense_context_t * context)
{
    uint32_t interruptState;
    
    Cy_CapSense_SsConfigPinRegisters(rxPtr->pcPtr, (uint32_t)rxPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_GPIO);

