aws/amazon-freertos/vendors/cypress/MTB/psoc6/mw/capsense/cy_capsense_csx.c
/*******************************************************************************
* Function Name: Cy_CapSense_CSXChangeClkFreq
****************************************************************************//**
*
* Calculates sensor frequency depending on the specified frequency channel.
*
* \param channelIndex
* Specifies frequency index.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSXChangeClkFreq(uint32_t channelIndex, cy_stc_capsense_context_t * context)
{
    uint32_t tmpRegVal;
    uint32_t snsClkDivider;
        
    /* SnsClk setup */
    snsClkDivider = (uint32_t) context->ptrActiveScanSns->ptrWdContext->snsClk;
    
    /* Check divider value */
    if (0u == snsClkDivider)
    {
        snsClkDivider = 1u;
    }

    /* Change the divider based on the chId */
    switch (channelIndex)
    {
        case CY_CAPSENSE_MFS_CH1_INDEX:
        {
            snsClkDivider += context->ptrCommonConfig->csxMfsDividerOffsetF1;
            break;
        }
        case CY_CAPSENSE_MFS_CH2_INDEX:
        {
            snsClkDivider += context->ptrCommonConfig->csxMfsDividerOffsetF2;
            break;
        }
        default:
        {
            break;
        }
    }
    
    tmpRegVal = (uint32_t)context->ptrActiveScanSns->ptrWdContext->snsClkSource & (uint32_t)~((uint32_t)CY_CAPSENSE_CLK_SOURCE_AUTO_MASK);
    tmpRegVal = ((tmpRegVal << CY_CAPSENSE_CSD_SENSE_PERIOD_LFSR_SIZE_POS) | (snsClkDivider - 1u) |
            CY_CAPSENSE_CSD_SENSE_PERIOD_LFSR_CLEAR_MSK | CY_CAPSENSE_CSD_SENSE_PERIOD_LFSR_BITS_MSK);
    /* Update reg value with divider and configuration */
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SENSE_PERIOD, tmpRegVal);

}

#endif /* CY_IP_MXCSDV2 */


/* [] END OF FILE */
